[
  {
    "title": "Improving Sequential Recommenders through Counterfactual Augmentation of\n  System Exposure",
    "url": "https://arxiv.org/abs/2504.13482v1",
    "pub_date": "2025-04-18",
    "summary": "In sequential recommendation (SR), system exposure refers to items that are exposed to the user. Typically, only a few of the exposed items would be interacted with by the user. Although SR has achieved great success in predicting future user interests, existing SR methods still fail to fully exploit system exposure data. Most methods only model items that have been interacted with, while the large volume of exposed but non-interacted items is overlooked. Even methods that consider the whole system exposure typically train the recommender using only the logged historical system exposure, without exploring unseen user interests.   In this paper, we propose counterfactual augmentation over system exposure for sequential recommendation (CaseRec). To better model historical system exposure, CaseRec introduces reinforcement learning to account for different exposure rewards. CaseRec uses a decision transformer-based sequential model to take an exposure sequence as input and assigns different rewards according to the user feedback. To further explore unseen user interests, CaseRec proposes to perform counterfactual augmentation, where exposed original items are replaced with counterfactual items. Then, a transformer-based user simulator is proposed to predict the user feedback reward for the augmented items. Augmentation, together with the user simulator, constructs counterfactual exposure sequences to uncover new user interests. Finally, CaseRec jointly uses the logged exposure sequences with the counterfactual exposure sequences to train a decision transformer-based sequential model for generating recommendation. Experiments on three real-world benchmarks show the effectiveness of CaseRec. Our code is available at https://github.com/ZiqiZhao1/CaseRec.",
    "translated": "在序列推荐（Sequential Recommendation, SR）系统中，系统曝光指呈现给用户的推荐物品集合。通常情况下，用户仅会与少量曝光物品产生交互行为。尽管现有SR方法在预测用户兴趣方面取得显著成效，但仍未充分利用系统曝光数据：大多数方法仅建模用户交互过的物品，而忽视了大量曝光未交互物品；即使考虑完整曝光记录的方法，也仅基于历史日志训练推荐模型，未能探索用户潜在兴趣。\n\n本文提出基于系统曝光的反事实增强序列推荐框架（CaseRec）。为更好建模历史曝光数据，CaseRec创新性地引入强化学习机制，通过差异化奖励机制处理不同曝光物品：采用基于决策变换器（Decision Transformer）的序列模型处理曝光序列，并根据用户反馈分配不同奖励。为挖掘用户潜在兴趣，CaseRec提出反事实增强策略——将原始曝光物品替换为反事实物品，并设计基于变换器的用户模拟器预测增强物品的反馈奖励。该增强机制与用户模拟器协同构建反事实曝光序列，从而发现新的用户兴趣点。最终，CaseRec联合原始曝光序列与反事实序列共同训练决策变换器模型以生成推荐。\n\n在三个真实场景基准测试上的实验验证了CaseRec的有效性。代码已开源：https://github.com/ZiqiZhao1/CaseRec\n\n（注：根据学术论文翻译规范，关键术语保持英文首字母大写并附加括号标注，如Decision Transformer；技术名词采用\"变换器/变换器模型\"对应transformer；长难句按中文表达习惯拆分为多个短句；被动语态转换为主动表述；保留项目代码链接格式）"
  }
]